dl-notes.org
#+TITLE: dl-notes
* CNN
** Convolution Operation
*** Comes from signal processing the ideas is that we can use an average of multiple measurements to get a more accurate representation of the signal.
*** However instead of the continuous version we tend to use the discrete version which is Sum(x(a)*w(t-a)) (continuous is just integral)
*** This can be viewed as a dot product using specific matrices like the toeplitz matrix
** Motivation
*** CNN benefits from sparse interactions this reduces runtime and allows for similar power due to sparsity since we only apply weight to certain patches to get a higher level representation instead of having to apply it for every feature
*** Parameter sharing reduces the amount of parameters that need to be learned since they are shared along the input
*** Equivariance changes in the input are reflected as changes in the input e.g. if patches move around in the picture then the convolution applied to that patch is translated in the same way
*** Convs are not equivariant to all changes but are equivariant to translation
** Pooling
*** Reduces the amount of paramters by summarizing local areas
*** This allows the operation to be invariant to small changes in the output since even small pixel shifts will get absorbed by the pooling.
** Theoretical Analysis/Pros and Cons
*** Theoretically we can view a CNN as a model which assumes an infinitely strong prior that we should be invariant to small changes. and learn from local areas
*** This is because we can view the matrix of parameters we learned as sparse due to the convolution operation.
*** This can cause underfitting like any prior since if we make assumptions that don't represent the data our model will be unable to learn.
*** Some cases of this are when we need to preserve precise spatial information where pooling the features can lead us to underfitting.
*** When trying to learn from distant feature it may not be useful to use convolutions which impose the prior that we learn from local patches
*** Finally we can only compare CNN's to CNN's due to the effects of permutation
** Variants of Convolution
*** When working with images we usually use multi-channel convolution where the linear operations are not guaranteed to be commutative
*** They are only commutative if each operation has the same # of input and output channels
*** We can add stride to act as a downsample (reduces how fine grain we produces features)
*** We can also add padding to prevent the shrinking of the image
*** Full padding allows for us to revisit the border as frequently as other pixels
*** We can also used an unshared convolution or locally connected layers which has different parameters but chooses which locality to use aka convolution with no param sharing
*** Can also used tiled convolutions
*** Gradient Derivation On page 357
** Structured Outputs
*** We do not just need to output class labels or regression values one thing we can do is create structured outputs that for example predict probability masks for each pixel in an image
** Data Types
*** Can process inputs with varying spatial extents. As opposed to fixed window of FNN's
*** Can work for 1-D 2-D 3-D both single and multi channel
** Random or Unsupervised Features
*** Using non supervised features in convolutions helps to reduce training time
*** One way to obtain these kernels is random init/or desining by hand. Finally one can use unsupervised approaches to learn these features
*** For unsupervised approach one way is to use k-means on small patches and using the centroid as convolution kernels
*** This is similar to pretraining the conv layers and then relearning the last layer which leads it to be similar to a convex optimization problem in the case of a logistic regression or SVM
*** Random filters also work well
*** One way for choosing architectures quickly is to first evaluate the performance of convolutional networks with random kernels and then train the final layers and evaluate performance
*** We can also do greedy layer-wise pretraining (train first layer in isolation then second layer etc.)
*** An example of this is the convolutional deep belief network
*** While unsupervised methods may be good most stuff is fully supervised however unsupervised can provide good results due to regularization or reduced computational costs of the leraning rule.
** Neuroscience basis for conv nets
*** Studies showed that early visual systems responded to certain light patterns while other light patterns did not make these systems respond
* RNN
*** Utilize parameter sharing to allow the model to learn different parts of the sequenece independent of location.
*** Similar to the idea introduced by TD networks however those have shallow connections due to localized neighbors
*** Can be applied to multiple dimensions and even have connections to previous time steps (Granted that all time steps are observed prior) Allowing the computation graph to contain cycles
** Unfolding Computational Graphs
*** Unfolding the computational graphs using recursive definitions we arrive at an acyclic representation of the computation graph.
*** We can furthermore paramterize this function using an input x where we see we include the input and a summary of the hidden state to create the output sequence.
*** Finally we use extra features to extract the information out of the final h and make a prediction
*** This hidden state is a lossy representation of the task-relevant aspects of the sequence till time T
*** It is guarenteed to be lossy since the sequence is indefinitely long while the hidden state is fixed in size
*** Due to selectively choosing which aspects of information to store. The hardest task for RNN's is when we need h to recover the input sequence like an autoencoder
*** By having the recurrent unfolding structure we are allowed to generalize to unseen sequence lengths due to parameter sharing. While also needing fewer samples.
*** The unfolded graph helps to be explicit by showing how information flows forward and how it flows backward when computing gradients
** Recurrent Neural Networks
*** RNN's have many different considerations on architectural design many-to-many, many-to-one, recurrence based on output
*** RNN's using many-to-many design can simulate any turing machine
*** Due to the nature of recurrence backprop is expensive requiring O(T) runtime for forward pass which cannot be reduced by parallelization since the input needs to be processed one after the other.
*** It also has a memory cost of O(T) due to needing the states for backwards computation
*** This computation is called backprop through time
** Teacher-Forcing and BPTT
*** The output recurrent architecture is strictly weaker since the output needs to capture the past while also matching the output target
*** However with this recurrent NN we can benefit from the fact that we can parallelize our loss function since we can use the ideal output as the input of our hidden state
*** We can use teacher forcing which is the idea of using the ground truch as input at time t+1
*** Models can utilize both BPTT and teacher forcing
