dl-notes.org
*** if used in open-loop mode the network outputs which are then used as inputs may not be like the test distribution
*** Some ways to mitigate this is to use teacher-forcing only after predicting a certain length of sequence, or to randomly choose generated values as input
** Computing the gradient
*** Gradient derivation
*** Essentially compute gradient onto the hidden layer where u need to sum the gradient of the output of that layer and the gradient of the next hidden state in relation to the current hidden state after that compute the gradient in respect to the params of the hidden state
** Recurrent Networks as Directed Graphical Models
*** We tend to model probability distributions with these models (e.g. cross-entropy for multiple classes or unit gaussian for regression)
*** One thing that is important is that when modeling this using MLE that P(y|x...) becomes P(y|x...,y_1...y_t-1) when we feed in the outputs of previous time steps as inputs.
*** this is important because many models tend to exclude any connections that deal with y (e.g. assuming markov property). However, the RNN inherently captures this through the previous bullet
*** This also shows that the RNN is efficient in describing the probability distribution over the dataset. One naive implementation for describing this probability distribution is using a table of probabilities where each entry is the probability of the class as time T this is O(k^T) where the RNN is O(1) since it doesnt scale with time T and is a constant set by the user
*** However while it is parameter efficient. It is not easy to optimize this model
*** There are also some assumptions made in this model. One of which is that the hidden state is not dependent on t when moving between time steps. One way to alleviate this is to add t as an input however then the model would need to learn this correlation
*** Finally the last thing to cover is how to sample from distribution. We can just sample normally from the conditional however we need to know when to stop the sequence. There are a few ways to sample one way is to create a symbol which means stop. Another is to add a bernoulli output that predicts whether or not to stop (this is a sigmoid output trained with BCE). Finally we can predict an integer that outputs the sequence length and then we sample n many times
** Modeling Sequences Conditioned on Context with RNN
*** In the last section we view the DAG as only representing a joint distribution, however the original formulation allows us to represet our distribution in a more powerful way. A joint distribution conditioned on the X variables (inputs).
*** As previously discussed any P(y; W) can be reinterpreted as P(y|W). we can furthermore extend it as P(y|X) where w is a function of x
*** We can provide the extra input either each timestep, as the initial hidden state or both.
*** In the case where we have a fixed input parameter we can concatenate our input value with our parameters in a way that models P(y|X)
*** We can also receive x as a sequence where in this case we assume P(y_1...y_T|x1..x_T) is conditionally independent and gets decomposed to Prod_T(P(y_t|x1...x_T))
*** To get rid of this independence we input the output into the next timestep
*** This however has one restriction in that x and y need to be the same sequence length (This is where we introduce seq2seq)
** Bidirectional RNNs
*** Previously we assume causality in that the value of y is computed strictly from previous x (and y)
*** However there are case in which we need to know the whole sequence's context
*** This can be very important for speech recognition tasks where the correct interpretation of the current phoneme depends on the next few phonemes.
*** In the case of two words that have ambiguity (e.g. buy and by) we may even need to look at previous word level outputs to remove ambiguity
*** this is also true of handwriting recognition and many other seq2seq learning tasks
*** These are extremely useful for handwriting recognition, speech recognition (may be useful for my intern project), and bioinformatics
*** The output of the bidirectional RNN allows us to create a model which is sensitive to context around t but also utilizes context from farther away and variable sequence length
*** This can be further extended to images which utilize an RNN that goes in 4 directions (Up D L R)
*** RNN's composed in this way allow for long range dependencies. Across the image
** Encoder-Decoder (seq2seq)
*** Comes up in many applications speech recogniition, machine translation, question answering
*** We often call the input the context and we want to produce a summary of that context for the decoder RNN
*** In seq2seq the two RNNs are trained to maximize P(y_1...y_ny| x_1..x_ny)
*** Encoder produces context C which is usually a function applied to the final H_nx of the encoder
*** Decoder is conditioned on that fix length vector to generate the output sequence. This allows nx != ny. In this architecture both RNNs are trained jointly to maximize the above function
*** As previously shown RNNs can receive context either as the hidden state or as input (There is no constraint that H_enc.shape == H_dec.shape)
*** The size of the encoder RNN is very important since it must be large enough to encapsulate all of the input sequence
*** Thus they decided to make C a variable length sequence rather than a fixed size vector and used Attention to learn how to associate elements of sequence C to the output (Explained in 12.4.5.1)
** Deep recurrent networks
*** The idea is self explanatory, however by empirical results it seems beneficial since we are only learning a shallow representation
*** We can think of lower layers as transforming the input to an easier to generalize representation.
*** We can also go a step further and add an MLP for every deep block (input to RNN layer, deep RNN block, deep output block) however this hurts optimization (obviously)
*** If we use a MLP for state to state transitions then the distance between hidden variables becomes 2x however, we can use skip connections to mitigate this
*** Deep RNNs can be structured either hierarchically, With deep MLPs in input to hidden, hidden to hidden, and hdden to output. And to mitigate difficulty of optimization we can add skip connections to mitigate the problem of optimization
** Recursive Neural Networks
*** a recursive nerual network generalize the recurrent structure into a recursive tree.
*** Good for processing data structures NLP and computer vision
*** The depth of a RNN can be reduced from T to O(log(T)). where depth is the number of compositions of nonlinear operations (e.g. in RNN amount of hidden transitions is linear as opposed to logrithmic in in recursive)
*** One option is to use a balanced binary tree. Another can be lead by domain expertise like for language using parse trees to lead the tree struture
*** Ideally it would be good for the learner to learn the tree structure
*** Computation at each node does not need to be the traditional neruon computation (e.g. linear combination + non-linear activaton). can use tensor + bilinear forms
** The Challenge of Long-Term Dependencies
*** As show previously gradients can either shrink or explode due to multiple multiplications of the jacobian in backpropagation
*** To exemplify this if we view each recurrent step as h_t = W.T h_t-1 the equation become h_t = W^t.T h_0
