dl-notes/dl-notes.tex
\item if used in open-loop mode the network outputs which are then used as inputs may not be like the test distribution
\item Some ways to mitigate this is to use teacher-forcing only after predicting a certain length of sequence, or to randomly choose generated values as input
\end{itemize}
\subsection{Computing the gradient}
\label{sec:org3480743}
\begin{itemize}
\item Gradient derivation
\item Essentially compute gradient onto the hidden layer where u need to sum the gradient of the output of that layer and the gradient of the next hidden state in relation to the current hidden state after that compute the gradient in respect to the params of the hidden state
\end{itemize}
\subsection{Recurrent Networks as Directed Graphical Models}
\label{sec:orga1c591f}
\begin{itemize}
\item We tend to model probability distributions with these models (e.g. cross-entropy for multiple classes or unit gaussian for regression)
\item One thing that is important is that when modeling this using MLE that P(y|x\ldots{}) becomes P(y|x\ldots{},y\textsubscript{1\ldots{}y}\textsubscript{t}-1) when we feed in the outputs of previous time steps as inputs.
\item this is important because many models tend to exclude any connections that deal with y (e.g. assuming markov property). However, the RNN inherently captures this through the previous bullet
\item This also shows that the RNN is efficient in describing the probability distribution over the dataset. One naive implementation for describing this probability distribution is using a table of probabilities where each entry is the probability of the class as time T this is O(k\textsuperscript{T}) where the RNN is O(1) since it doesnt scale with time T and is a constant set by the user
\item However while it is parameter efficient. It is not easy to optimize this model
\item There are also some assumptions made in this model. One of which is that the hidden state is not dependent on t when moving between time steps. One way to alleviate this is to add t as an input however then the model would need to learn this correlation
\item Finally the last thing to cover is how to sample from distribution. We can just sample normally from the conditional however we need to know when to stop the sequence. There are a few ways to sample one way is to create a symbol which means stop. Another is to add a bernoulli output that predicts whether or not to stop (this is a sigmoid output trained with BCE). Finally we can predict an integer that outputs the sequence length and then we sample n many times
\end{itemize}
\subsection{Modeling Sequences Conditioned on Context with RNN}
\label{sec:org56fec98}
\begin{itemize}
\item In the last section we view the DAG as only representing a joint distribution, however the original formulation allows us to represet our distribution in a more powerful way. A joint distribution conditioned on the X variables (inputs).
\item As previously discussed any P(y; W) can be reinterpreted as P(y|W). we can furthermore extend it as P(y|X) where w is a function of x
\item We can provide the extra input either each timestep, as the initial hidden state or both.
\item In the case where we have a fixed input parameter we can concatenate our input value with our parameters in a way that models P(y|X)
\item We can also receive x as a sequence where in this case we assume P(y\textsubscript{1\ldots{}y}\textsubscript{T}|x1..x\textsubscript{T}) is conditionally independent and gets decomposed to Prod\textsubscript{T}(P(y\textsubscript{t}|x1\ldots{}x\textsubscript{T}))
\item To get rid of this independence we input the output into the next timestep
\item This however has one restriction in that x and y need to be the same sequence length (This is where we introduce seq2seq)
\end{itemize}
\subsection{Bidirectional RNNs}
\label{sec:orgef3b478}
\begin{itemize}
\item Previously we assume causality in that the value of y is computed strictly from previous x (and y)
\item However there are case in which we need to know the whole sequence's context
\item This can be very important for speech recognition tasks where the correct interpretation of the current phoneme depends on the next few phonemes.
\item In the case of two words that have ambiguity (e.g. buy and by) we may even need to look at previous word level outputs to remove ambiguity
\item this is also true of handwriting recognition and many other seq2seq learning tasks
\item These are extremely useful for handwriting recognition, speech recognition (may be useful for my intern project), and bioinformatics
\item The output of the bidirectional RNN allows us to create a model which is sensitive to context around t but also utilizes context from farther away and variable sequence length
\item This can be further extended to images which utilize an RNN that goes in 4 directions (Up D L R)
\item RNN's composed in this way allow for long range dependencies. Across the image
\end{itemize}
\subsection{Encoder-Decoder (seq2seq)}
\label{sec:orgae7fc88}
\begin{itemize}
\item Comes up in many applications speech recogniition, machine translation, question answering
\item We often call the input the context and we want to produce a summary of that context for the decoder RNN
\item In seq2seq the two RNNs are trained to maximize P(y\textsubscript{1\ldots{}y}\textsubscript{ny}| x\textsubscript{1..x}\textsubscript{ny})
\item Encoder produces context C which is usually a function applied to the final H\textsubscript{nx} of the encoder
\item Decoder is conditioned on that fix length vector to generate the output sequence. This allows nx != ny. In this architecture both RNNs are trained jointly to maximize the above function
\item As previously shown RNNs can receive context either as the hidden state or as input (There is no constraint that H\textsubscript{enc.shape} == H\textsubscript{dec.shape})
\item The size of the encoder RNN is very important since it must be large enough to encapsulate all of the input sequence
\item Thus they decided to make C a variable length sequence rather than a fixed size vector and used Attention to learn how to associate elements of sequence C to the output (Explained in 12.4.5.1)
\end{itemize}
\subsection{Deep recurrent networks}
\label{sec:orgf7d919d}
\begin{itemize}
\item The idea is self explanatory, however by empirical results it seems beneficial since we are only learning a shallow representation
\item We can think of lower layers as transforming the input to an easier to generalize representation.
\item We can also go a step further and add an MLP for every deep block (input to RNN layer, deep RNN block, deep output block) however this hurts optimization (obviously)
\item If we use a MLP for state to state transitions then the distance between hidden variables becomes 2x however, we can use skip connections to mitigate this
\item Deep RNNs can be structured either hierarchically, With deep MLPs in input to hidden, hidden to hidden, and hdden to output. And to mitigate difficulty of optimization we can add skip connections to mitigate the problem of optimization
\end{itemize}
\subsection{Recursive Neural Networks}
\label{sec:orgf22a960}
\begin{itemize}
\item a recursive nerual network generalize the recurrent structure into a recursive tree.
\item Good for processing data structures NLP and computer vision
\item The depth of a RNN can be reduced from T to O(log(T)). where depth is the number of compositions of nonlinear operations (e.g. in RNN amount of hidden transitions is linear as opposed to logrithmic in in recursive)
\item One option is to use a balanced binary tree. Another can be lead by domain expertise like for language using parse trees to lead the tree struture
\item Ideally it would be good for the learner to learn the tree structure
\item Computation at each node does not need to be the traditional neruon computation (e.g. linear combination + non-linear activaton). can use tensor + bilinear forms
\end{itemize}
\subsection{The Challenge of Long-Term Dependencies}
\label{sec:org75fa46e}
\begin{itemize}
\item As show previously gradients can either shrink or explode due to multiple multiplications of the jacobian in backpropagation
\item To exemplify this if we view each recurrent step as h\textsubscript{t} = W.T h\textsubscript{t}-1 the equation become h\textsubscript{t} = W\textsuperscript{t.T} h\textsubscript{0}
