dl-notes/dl-notes.tex
\item if we assume W.T can be decomposed into a Q L Q.T (eigendecomposition of a symmetric matrix) then the formula become h\textsubscript{t} = Q.T L\textsuperscript{t} Q h\textsubscript{0}
\item Therefore the eigenvalues of the matrix decomposition determine whether or not the gradients explode or vanish as sequences get longer. However, all eigenvalues of 1 will not be affected
\item However since it is very unlikely for all values to be == 1, it is almost certain that this will explode/vanish.
\item Also besides that we in order for RNN's to store memories robust to perturbations the RNN must enter the space where gradients vanish
\item This doesn't mean that long term memories are impossible to form, moreso that it will take a very long time to learn as opposed to short term depndencies, and are sensative to fluctuations in short term dependencies.
\item Empirically it was shown that at sequence lengths of 10 or 20 the gradient started to approach 0
\item While there have been some remedies that have been proposed in the upcoming sections. It is probably one of the main challenges in DL.
\end{itemize}
\subsection{Echo state networks}
\label{sec:orgb0f8a71}
\begin{itemize}
\item The most difficult parameters to learn are the mappings from h\textsubscript{t}-1 and x to h\textsubscript{t}
\item One way that was proposed is to set recurrent weights manually/programtically such that it does a good job of capturing past weights
\item These are called reservoir computing, in that it draws from a resvoir of previous outputs
\item Its similar to a kernel in that it maps an arbitrary length sequence to a fixed length vector.
\item One benefit of this view is that it is essentially a linear regression which is convex when using certain losses
\item The spectral radius (largest absolute valued eigenvalue) will maximize the seperation of perturbations thus being a good candidate for seperating differences
\item Something is contractive when a linear mapping always shrinks h. When the spectral radius is < 1 it is always contractive (explaining the thing b4 about having RNN's needing to explore vanishing gradient space to be resistant to small perturbations)
\item Even if the values were complex values what matters most is the complex absolute value in which case magnitudes >1 explode and <1 shrink
\item The idea for echo networks is to fix weights that have high spectral radius but doesn't explode due to the effect of saturation of things like tanh
\end{itemize}
\subsection{Leaky Units and other strategies for multiple time scales}
\label{sec:orgb8fb4ef}
\begin{itemize}
\item One strategy is to incorporate leaky units and other things which allows us to view things with multiple time scales (e.g. short term and long term).
\end{itemize}
\subsection{Skip Connections through Time}
\label{sec:orgf479358}
\begin{itemize}
\item Same idea as skip connections in CNNs by adding recurrent connections that operate every d steps it decreases decay to only t/d as opposed to t. gradients can still explode in time t
\end{itemize}
\subsection{Leaky units and a spectrum of different time scales}
\label{sec:orgf474dce}
\begin{itemize}
\item Another way to get derivatives close to one is to have linear self-connections and a weight near one on these connections.
\item An example of this is having a running average of mu\textsubscript{t} and some value v\textsubscript{t} and using the function u\textsubscript{t} = a*u\textsubscript{t}-1 + (1-a)*v\textsubscript{t}. in this case a is a linear self-connection since a either fully remembers the previous value and when a is near zero it updates the information.
\item When hidden units have learn self-connections they behave similarly to running averages like mentioned above and are called leaky units.
\item There are two strategies. Sampling them during initialization time or learning them.
\item Having these at different time scales allows us to better model long term dependencies
\end{itemize}
\subsection{Removing Connections}
\label{sec:orgddbb668}
\begin{itemize}
\item Anotherway is organizing the rnn at multiple time scales.
\item The idea is to remove length-one connections and replace them with longer connections.
\item This differs from skip connections since those add edges.
\item You can also mix in leaky units to this.
\end{itemize}
\subsection{The LSTM and other Gated RNNs}
\label{sec:orgc473173}
\begin{itemize}
\item Using the idea of leaky units we want to have the option to choose when to keep and when to remove information from the hidden state.
\item Ideally we don't want to do this ourselves and instead we make the NN learn when to dynamically forget or remember information this is what gated units do.
\end{itemize}
\subsection{RNNs (Not that many notes because I have studied this a lot)}
\label{sec:org863975f}
\begin{itemize}
\item Aside from the default equations for the LSTM update rules you can also include the hidden state into the context for computing the gates.
\end{itemize}
\subsection{Other gated RNNs}
\label{sec:org1851734}
\begin{itemize}
\item GRU (prolly not that many notes)
\item uses a single gating unit using the update gate and reset gate which chooses to ignore certain aspects of the input and update determines the full updating rule
\item Some other things can be designed with this as a base (sharing forget gates across multiple hidden units). Global gate could also be used
\item No variant between LSTM and GRU are proven to provide clear superior model.
\end{itemize}
\subsection{Optimization for long term dependencies}
\label{sec:orgacab88b}
\begin{itemize}
\item After some research it has been shown that second order derivatives may dissapear at the same time as first order derivatives. These second order optimization methods are also difficult to optimize and are attracted to saddle points. It has been shown that first order algorithms tend to work better in practice.
\item It goes to show that sometimes simpler easy to optimize algorithms are better than more powerful algorithms
\end{itemize}
\subsection{Clipping Gradients}
\label{sec:orgd27fec9}
\begin{itemize}
\item Due to the problem of cliffs in the loss curvature it may cause gradient updates to massively overshoot and lead them to worse optima.
\item Therefore we use gradient clipping to prevent this one way is based off of clipping it elementwise and another is to normalize it with the norm of the gradient
\item e.g if ||g|| > v g = g*v/||g||
\item While theoretically the norm based way may seem better due to perserving direction both work about as well empirically.
\item Elementwise clipping can be good in the case of Inf/Nan where moving in a random direction will help to get out of the bad area.
\item Also elementwise clipping introduces a heuristic bias to the estimator of the overall gradient that is attempted to be performed in minibatch gradient descent.
\end{itemize}
\subsection{Regularizing the gradient}
\label{sec:org4cdc315}
\begin{itemize}
\item While clipping helps explosion it doesnt help vanishin
\item As shown previously we want the gradient values to be close to 1 so that we can minimize the possibility of gradient vanishing
\item Therefore we can regularize the gradient such that it can be about as large as the gradient that flowed into the current step of the computation graph.
\item When combined with gradient clipping it is beneficial in helping RNN learn long term dependencies.
\end{itemize}
\subsection{Explicit memory}
\label{sec:org4c4066b}
\begin{itemize}
\item NN's are good at storing implicit memories (subconscious). However struggle with explicit memories and require seeing something many times to remember something.
\item Some people have designed systems to act as working memory (explicit memory which stores information relevant to a goal)
\item Hinton believes that it is more important to see how NN's change inputs in regard to the time steps is more important that the actual mapping in terms of determining if reasoning actually exists.
\item Some models like memory networks and Neural Turing Machines try to adress this.
\item NTM's use read write actions from memory cells via attention mechanisms.
\item Since its difficult to find exactly which address to access it does it parallel on multiple addresses using a softmax to figure out which cells to access.
