dl-notes/dl-notes.tex
\item Instead of storing scalars we store vectors in explicit memory since its more costly, and also acts like content based addressing e.g. when we remember stuff its like we specifically access the part of our memory that related to certain content.
\item Attention is important.
\end{itemize}
\end{document}
